Kozurofu-San/kozurofu-drivers/platforms/STM32F1/TimerDriver.h
#pragma once

#include "interface/Timer.h"

#include "stm32f1xx.h"

extern uint32_t SystemCoreClock;

namespace driver
{

class TimerDriver : public ITimer
{
    public:

    TimerDriver(TIM_TypeDef *timer)
        : _timer(timer) {}

    bool init(Time time)
    {
        if (time.value == 0U)
        {
            return false;
        }

        // TIMxCLK is PCLKx when the APB prescaler is 1, otherwise 2 * PCLKx.
        uint32_t busPrescalerPos = (( _timer == TIM1 )) ? RCC_CFGR_PPRE2_Pos : RCC_CFGR_PPRE1_Pos;
        uint32_t busPrescaler = (RCC->CFGR >> busPrescalerPos) & 0x7;
        busPrescaler = (busPrescaler < 4) ? 1 : (1 << (busPrescaler - 3));
        _speed = SystemCoreClock / busPrescaler;

        // RM 8.2
        if (busPrescaler != 1U)
        {
            _speed *= 2U;
        }
        
        if (_speed == 0)
        {
            return false;
        }

        // RM 3
        RCC->APB1ENR |= (_timer == TIM2 ) ? RCC_APB1ENR_TIM2EN  :
                        (_timer == TIM3 ) ? RCC_APB1ENR_TIM3EN  :
                        (_timer == TIM4 ) ? RCC_APB1ENR_TIM4EN  :
                        0;
        
        RCC->APB2ENR |= (_timer == TIM1 ) ? RCC_APB2ENR_TIM1EN  :
                        0;
        
        const uint32_t unitsPerSecond = (time.unit == Units::ns) ? 1'000'000'000U :
                                        (time.unit == Units::us) ? 1'000'000U :
                                        (time.unit == Units::ms) ? 1'000U : 1U;
        const uint64_t periodTicks = (static_cast<uint64_t>(_speed) * time.value) / unitsPerSecond;
        if (periodTicks == 0U)
        {
            return false;
        }

        // Choose a prescaler which makes ARR fit in the 16-bit timer.
        const uint32_t divider = static_cast<uint32_t>((periodTicks + 0xFFFFU) / 0x10000U);
        const uint32_t reload = static_cast<uint32_t>(periodTicks / divider);

        // Config. UG transfers PSC/ARR from their preload registers before CEN.
        _timer->CR1 = 0U;
        _timer->DIER = 0U;
        _timer->PSC = divider - 1U;
        _timer->ARR = reload - 1U;
        _timer->EGR = TIM_EGR_UG;
        _timer->SR = 0;
        _timer->DIER = TIM_DIER_UIE;

        uint32_t irq = (_timer == TIM1 ) ? TIM1_TRG_COM_TIM11_IRQn  :
                    (_timer == TIM2 ) ? TIM2_IRQn  :
                    (_timer == TIM3 ) ? TIM3_IRQn  :
                    (_timer == TIM4 ) ? TIM4_IRQn  :
                    0;
        NVIC_SetPriority(static_cast<IRQn_Type>(irq), 5);
        NVIC_EnableIRQ(static_cast<IRQn_Type>(irq));

        _isInit = true;
        return true;
    }

    void setPeriod(Time time){

    }
    Time getPeriod(){
        return {0, Units::s};
    }

    inline void clearInterrupt()
    {
        // Status flags are cleared by writing zero.  Keep non-update flags intact.
        _timer->SR = ~TIM_SR_UIF;
    }

    inline void start() override
    {
        _timer->CR1 |= TIM_CR1_CEN;
    }

    inline void stop() override
    {
        _timer->CR1 &= ~TIM_CR1_CEN;
    }

    void reset() override
    {
        _timer->CNT = 0;
    }

    void delay(uint32_t value) override
    {
        uint32_t start = _cnt;
        while ((uint32_t)(_cnt - start) < value)
        {
            asm volatile("nop");
        }
    }

    inline uint32_t now() override
    {
        return _cnt;
    }
    
    void callback(void (*cb)(uint32_t)) override
    {
        _cb = cb;
    }
    
    void interrupt()
    {
        _cnt = _cnt + 1U;
        // if (_cb != nullptr)
        // {
        //     _cb(0);
        // }
    }
    
    uint32_t getSpeed() override
    {
        return _speed;
    }
    
    bool isInit() override
    {
        return _isInit;
    }

    private:

    TIM_TypeDef *_timer;
    // Updated by the timer ISR and polled by delay().
    volatile uint32_t _cnt = 0;
    uint32_t _speed = 0;

    bool _isInit = false;
    void (*_cb)(uint32_t) = nullptr;
};

}
